docs/torsten_users_guide.org
#+TITLE: Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan
#+SUBTITLE: User's Guide @@latex:\\@@ @@html:<br>@@ (Torsten Version 0.90.0, Stan version 2.29.2)
#+LATEX_CLASS: amsbook
#+LATEX_CLASS_OPTIONS: [12pt, reqno, oneside]

# title page
#+LATEX_HEADER: \newcommand\subtitle[1]{\newcommand\mrgsubtitle{#1}}
#+LATEX_HEADER: \newcommand\mrgproject{}
#+LATEX_HEADER: \newcommand\mrgtitle{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan}
#+LATEX_HEADER: \newcommand\mrgsubtitle{\large{User's Guide} \linebreak (Torsten Version 0.90.0, Stan version 2.29.2)}
#+LATEX_HEADER: \include{mrgtitlepage}

# make index
#+LATEX_HEADER: \usepackage{imakeidx}
#+LATEX_HEADER: \makeindex

#+LATEX_HEADER: \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{epstopdf}

# define MRG branding color
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{MRGGreen}{rgb}{0, 0.350, 0.200}
#+LATEX_HEADER: \usepackage[colorlinks=true, citecolor=MRGGreen, urlcolor=MRGGreen, linkcolor=MRGGreen]{hyperref}

#+LATEX_HEADER: \usepackage{bold-extra}
#+LATEX_HEADER: \usepackage{courier}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX_HEADER: \usepackage{subcaption}

# remove "chapter" in chapter name
#+LATEX_HEADER: \renewcommand{\chaptername}{}
#+LATEX_HEADER: \numberwithin{equation}{chapter}
#+LATEX_HEADER: \numberwithin{figure}{chapter}
#+LATEX_HEADER: \numberwithin{table}{chapter}

#+LATEX_HEADER: \usepackage[section]{placeins}

# section numbering begins with chapter
** ODE group  integrator Function
   :PROPERTIES:
   :EXPORT_FILE_NAME: ode-group-integ
   :EXPORT_DATE: <2021-06-25 Fri>
   :EXPORT_OPTIONS: toc:t
   :END:
#+INDEX: PMX ODE group integrators
*** Description
All the preivous functions solves for a single ODE system. Torsten also
provides group modeling counterparts for ODE integrators. The
functions solve for a group of ODE systems that share an ODE RHS but with
different parameters. They have similar
signatures to single-ODE integration functions.
*** Usage
#+BEGIN_SRC stan
  matrix pmx_integrate_ode_group_[adams || rk45 || bdf](ODE_system, real[ , ] y0, real t0, int[] len, real[] ts, real[ , ] theta, real[ , ] x_r, int[ , ] x_i, [ real rtol, real atol, int max_step ] );
#+END_SRC
Here src_stan[:exports code]{[adams || rk45 || bdf]} indicates the
function name can be of any of the three suffixes. See Section [[*ODE integrator function]].
- =ODE_rhs=
     Function that specifies the right-hand-side $f$. See Section [[*ODE integrator function]].
- =y0=
     Initial condition $y_0$ for each subsystem in the group. The
     first dimension equals to the size of the group.
- =t0=
     Initial time $t_0$.
- =len=
     A vector that contains the number of output time points for each
     subsystem. The lenght of the vector equals to the size of the group.
- =ts=
     Output time when solution is seeked, consisting of
     =ts= of each subsystem concatenated.
- =theta=
     2d-array parameters to be passed to =ODE_rhs=
     function. Each row corresponds to one subsystem.
- =x_r=
     2d-array real data to be passed to =ODE_rhs= function.
     Each row corresponds to one subsystem.
- =x_i=
     2d-array integer data to be passed to =ODE_rhs= function.
     Each row corresponds to one subsystem.
- =rtol=
     Relative tolerance.
- =atol=
     Absolute tolerance.
- =max_step=
     Maximum number of steps allowed between neighboring time in =ts=.

*** Return value
    An =n=-by-=nd= matrix, where =n= is the size of =ts=
    and =nd= the dimension of the system.
*** Note
    - With optional arguments indicated by square bracket, the following calls are allowed:
#+BEGIN_SRC stan
  pmx_integrate_group_[adams || rk45 || bdf](..., x_i);
  pmx_integrate_group_[adams || rk45 || bdf](..., x_i, rel_tol, abs_tol, max_step);
#+END_SRC
    - The group integrators support paralleisation through Message Passing
      Interface(MPI). One can access this feature through =cmdstan= or
      =cmdstanr= interface.
#+BEGIN_SRC bash
  # cmdstan interface user need to add "TORSTEN_MPI=1" and
  # "TBB_CXX_TYPE=gcc" in "cmdstan/make/local" file. In linux & macos
  # this can be done as
  echo "TORSTEN_MPI=1" > cmdstan/make/local
  echo "TBB_CXX_TYPE=gcc" > cmdstan/make/local # "gcc" should be replaced by user's C compiler
  make path-to-model/model_name
  mpiexec -n number_of_processes model_name sample... # additional cmdstan options
#+END_SRC
#+BEGIN_SRC r
  library("cmdstanr")
  cmdstan_make_local(cpp_options = list("TORSTEN_MPI" = "1", "TBB_CXX_TYPE"="gcc"))  # "gcc" should be replaced by user's C compiler
  rebuild_cmdstan()
  mod <- cmdstan_model(path-to-model-file, quiet=FALSE, force_recompile=TRUE)
  f <- mod$sample_mpi(data = ..., chains = 1, mpi_args = list("n" = number_of_processes), refresh = 200)
#+END_SRC
  Here $n$ denotes number of MPI processes, so that $N$
  ODE systems are distributed to and solved by $n$
  processes evenly. Note that to access this feature user must have
  MPI installed, and some MPI installation may require set additional
  compiler arguments, such as =CXXLFAGS= and =LDFLAGS=.

